app/views/orders/new.haml

SELECT "menu_items".* FROM "menu_items"
---
            .form-check
              = form.check_box :menu_item_ids, { multiple: true, checked: @order.menu_item_ids.include?(item.id) }, item.id, nil