app/controllers/kitchen_display_controller.rb

    def mark_prepared
      order_item = OrderItem.find(params[:order_item_id])
      order_item.update(prepared: true)
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "order_items" SET "prepared" = ?, "updated_at" = ? WHERE "order_items"."id" = ?  [["prepared", 1], ["updated_at", "2024-03-10 16:45:46.208219"], ["id", 1]]