app/controllers/orders_controller.rb

SELECT "menu_items".* FROM "menu_items"
---
    def new
      @order = Order.new
      @menu_items = MenuItem.all

INSERT INTO "orders" ("car_registration", "paid", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["car_registration", "1r432d"], ["paid", nil], ["created_at", "2024-03-10 15:02:49.325998"], ["updated_at", "2024-03-10 15:02:49.325998"]]
---
    def create
      @order = Order.new(order_params)


      if @order.save

SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" IN (?, ?)  [["id", 1], ["id", 2]]
---
    def pickup
        @ready_orders = Order.includes(:order_items).where(order_items: { prepared: true })

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 50], ["LIMIT", 1]]
UPDATE "orders" SET "paid" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["paid", 1], ["updated_at", "2024-03-10 18:59:01.180648"], ["id", 50]]
---
      def mark_paid
        @order = Order.find(params[:id])
        @order.update(paid: true)