app/models/order.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN (?, ?)  [["order_id", 24], ["order_id", 25]]
SELECT "orders".* FROM "orders" WHERE "orders"."paid" IS NULL
---
    scope :fully_prepared, -> {
        where(paid: nil)
          .includes(:order_items)
          .select { |order| order.order_items.all?(&:prepared) }